In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series(['a', 'dd', 'er', 'SDSAD'])
new_s = s

In [3]:
new_s[0] = 'ER'
s

0       ER
1       dd
2       er
3    SDSAD
dtype: object

In [4]:
new_s = s.copy()

In [7]:
new_s[0] = 'NEW'
new_s

0      NEW
1       dd
2       er
3    SDSAD
dtype: object

In [8]:
s

0       ER
1       dd
2       er
3    SDSAD
dtype: object

In [9]:
# dataframe.copy()

In [11]:
# .copy(deep=True) # by default deep is True

In [12]:
"""
new_s = s
and
new_s = s.copy(deep=False)
Are similar together but in the first case they will be exactly like eachother or they will be each other,
But in the second one, data are shared but structured NOT, means you can use the variable in another aspect and shape and structure.
"""

'\nnew_s = s\nand\nnew_s = s.copy(deep=False)\nAre similar together but in the first case they will be exactly like eachother or they will be each other,\nBut in the second one, data are shared but structured NOT, means you can use the variable in another aspect and shape and structure.\n'

In [15]:
df = pd.DataFrame(np.random.rand(3, 3))
df

          0         1         2
0  0.685458  0.198597  0.357288
1  0.696374  0.516128  0.576505
2  0.189271  0.423421  0.180011

In [16]:
new_df = df.copy(deep=False)

In [17]:
new_df.index is df.index

True

In [18]:
new_df['new_column'] = 0
df

          0         1         2
0  0.685458  0.198597  0.357288
1  0.696374  0.516128  0.576505
2  0.189271  0.423421  0.180011

In [19]:
new_df

          0         1         2  new_column
0  0.685458  0.198597  0.357288           0
1  0.696374  0.516128  0.576505           0
2  0.189271  0.423421  0.180011           0

In [22]:
new_df.at[0, 0] = 99

In [23]:
df

           0         1         2
0  99.000000  0.198597  0.357288
1   0.696374  0.516128  0.576505
2   0.189271  0.423421  0.180011

In [25]:
np.may_share_memory(df[0], new_df[0])

True